ErichStyger/mcuoneclipse/Examples/KDS/FRDM-KE02Z/FRDM-KE02Z/Static_Code/IO_Map/MKE02Z2.h
/* NV - Peripheral instance base addresses */
/** Peripheral FTMRH_FlashConfig base pointer */
#define FTMRH_FlashConfig_BASE_PTR               ((NV_MemMapPtr)0x400u)
/** Array initializer of NV peripheral base pointers */
#define NV_BASE_PTRS                             { FTMRH_FlashConfig_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- NV - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NV_Register_Accessor_Macros NV - Register accessor macros
 * @{
 */


/* NV - Register instance definitions */
/* FTMRH_FlashConfig */
#define NV_BACKKEY0                              NV_BACKKEY0_REG(FTMRH_FlashConfig_BASE_PTR)
#define NV_BACKKEY1                              NV_BACKKEY1_REG(FTMRH_FlashConfig_BASE_PTR)
#define NV_BACKKEY2                              NV_BACKKEY2_REG(FTMRH_FlashConfig_BASE_PTR)
#define NV_BACKKEY3                              NV_BACKKEY3_REG(FTMRH_FlashConfig_BASE_PTR)
#define NV_BACKKEY4                              NV_BACKKEY4_REG(FTMRH_FlashConfig_BASE_PTR)
#define NV_BACKKEY5                              NV_BACKKEY5_REG(FTMRH_FlashConfig_BASE_PTR)
#define NV_BACKKEY6                              NV_BACKKEY6_REG(FTMRH_FlashConfig_BASE_PTR)
#define NV_BACKKEY7                              NV_BACKKEY7_REG(FTMRH_FlashConfig_BASE_PTR)
#define NV_EEPROT                                NV_EEPROT_REG(FTMRH_FlashConfig_BASE_PTR)
#define NV_FPROT                                 NV_FPROT_REG(FTMRH_FlashConfig_BASE_PTR)
#define NV_FSEC                                  NV_FSEC_REG(FTMRH_FlashConfig_BASE_PTR)
#define NV_FOPT                                  NV_FOPT_REG(FTMRH_FlashConfig_BASE_PTR)

/*!
 * @}
 */ /* end of group NV_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group NV_Peripheral */


/* ----------------------------------------------------------------------------
   -- NVIC
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NVIC_Peripheral NVIC
 * @{
 */

/** NVIC - Peripheral register structure */
typedef struct NVIC_MemMap {
  uint32_t ISER;                                   /**< Interrupt Set Enable Register, offset: 0x0 */
  uint8_t RESERVED_0[124];
  uint32_t ICER;                                   /**< Interrupt Clear Enable Register, offset: 0x80 */
  uint8_t RESERVED_1[124];
  uint32_t ISPR;                                   /**< Interrupt Set Pending Register, offset: 0x100 */
  uint8_t RESERVED_2[124];
  uint32_t ICPR;                                   /**< Interrupt Clear Pending Register, offset: 0x180 */
  uint8_t RESERVED_3[380];
  uint32_t IP[8];                                  /**< Interrupt Priority Register 0..Interrupt Priority Register 7, array offset: 0x300, array step: 0x4 */
} volatile *NVIC_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- NVIC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NVIC_Register_Accessor_Macros NVIC - Register accessor macros
 * @{
 */


/* NVIC - Register accessors */
#define NVIC_ISER_REG(base)                      ((base)->ISER)
#define NVIC_ICER_REG(base)                      ((base)->ICER)
#define NVIC_ISPR_REG(base)                      ((base)->ISPR)
#define NVIC_ICPR_REG(base)                      ((base)->ICPR)
#define NVIC_IP_REG(base,index)                  ((base)->IP[index])
#define NVIC_IP_COUNT                            8

/*!
 * @}
 */ /* end of group NVIC_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- NVIC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NVIC_Register_Masks NVIC Register Masks
 * @{
 */

/* ISER Bit Fields */
#define NVIC_ISER_SETENA0_MASK                   0x1u
#define NVIC_ISER_SETENA0_SHIFT                  0
#define NVIC_ISER_SETENA0_WIDTH                  1
#define NVIC_ISER_SETENA0(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA0_SHIFT))&NVIC_ISER_SETENA0_MASK)
#define NVIC_ISER_SETENA1_MASK                   0x2u
#define NVIC_ISER_SETENA1_SHIFT                  1
#define NVIC_ISER_SETENA1_WIDTH                  1
#define NVIC_ISER_SETENA1(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA1_SHIFT))&NVIC_ISER_SETENA1_MASK)
#define NVIC_ISER_SETENA2_MASK                   0x4u
#define NVIC_ISER_SETENA2_SHIFT                  2
#define NVIC_ISER_SETENA2_WIDTH                  1
#define NVIC_ISER_SETENA2(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA2_SHIFT))&NVIC_ISER_SETENA2_MASK)
#define NVIC_ISER_SETENA3_MASK                   0x8u
#define NVIC_ISER_SETENA3_SHIFT                  3
#define NVIC_ISER_SETENA3_WIDTH                  1
#define NVIC_ISER_SETENA3(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA3_SHIFT))&NVIC_ISER_SETENA3_MASK)
#define NVIC_ISER_SETENA4_MASK                   0x10u
#define NVIC_ISER_SETENA4_SHIFT                  4
#define NVIC_ISER_SETENA4_WIDTH                  1
#define NVIC_ISER_SETENA4(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA4_SHIFT))&NVIC_ISER_SETENA4_MASK)
#define NVIC_ISER_SETENA5_MASK                   0x20u
#define NVIC_ISER_SETENA5_SHIFT                  5
#define NVIC_ISER_SETENA5_WIDTH                  1
#define NVIC_ISER_SETENA5(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA5_SHIFT))&NVIC_ISER_SETENA5_MASK)
#define NVIC_ISER_SETENA6_MASK                   0x40u
#define NVIC_ISER_SETENA6_SHIFT                  6
#define NVIC_ISER_SETENA6_WIDTH                  1
#define NVIC_ISER_SETENA6(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA6_SHIFT))&NVIC_ISER_SETENA6_MASK)
#define NVIC_ISER_SETENA7_MASK                   0x80u
#define NVIC_ISER_SETENA7_SHIFT                  7
#define NVIC_ISER_SETENA7_WIDTH                  1
#define NVIC_ISER_SETENA7(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA7_SHIFT))&NVIC_ISER_SETENA7_MASK)
#define NVIC_ISER_SETENA8_MASK                   0x100u
#define NVIC_ISER_SETENA8_SHIFT                  8
#define NVIC_ISER_SETENA8_WIDTH                  1
#define NVIC_ISER_SETENA8(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA8_SHIFT))&NVIC_ISER_SETENA8_MASK)
#define NVIC_ISER_SETENA9_MASK                   0x200u
#define NVIC_ISER_SETENA9_SHIFT                  9
#define NVIC_ISER_SETENA9_WIDTH                  1
#define NVIC_ISER_SETENA9(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA9_SHIFT))&NVIC_ISER_SETENA9_MASK)
#define NVIC_ISER_SETENA10_MASK                  0x400u
#define NVIC_ISER_SETENA10_SHIFT                 10
#define NVIC_ISER_SETENA10_WIDTH                 1
#define NVIC_ISER_SETENA10(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA10_SHIFT))&NVIC_ISER_SETENA10_MASK)
#define NVIC_ISER_SETENA11_MASK                  0x800u
#define NVIC_ISER_SETENA11_SHIFT                 11
#define NVIC_ISER_SETENA11_WIDTH                 1
#define NVIC_ISER_SETENA11(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA11_SHIFT))&NVIC_ISER_SETENA11_MASK)
#define NVIC_ISER_SETENA12_MASK                  0x1000u
#define NVIC_ISER_SETENA12_SHIFT                 12
#define NVIC_ISER_SETENA12_WIDTH                 1
#define NVIC_ISER_SETENA12(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA12_SHIFT))&NVIC_ISER_SETENA12_MASK)
#define NVIC_ISER_SETENA13_MASK                  0x2000u
#define NVIC_ISER_SETENA13_SHIFT                 13
#define NVIC_ISER_SETENA13_WIDTH                 1
#define NVIC_ISER_SETENA13(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA13_SHIFT))&NVIC_ISER_SETENA13_MASK)
#define NVIC_ISER_SETENA14_MASK                  0x4000u
#define NVIC_ISER_SETENA14_SHIFT                 14
#define NVIC_ISER_SETENA14_WIDTH                 1
#define NVIC_ISER_SETENA14(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA14_SHIFT))&NVIC_ISER_SETENA14_MASK)
#define NVIC_ISER_SETENA15_MASK                  0x8000u
#define NVIC_ISER_SETENA15_SHIFT                 15
#define NVIC_ISER_SETENA15_WIDTH                 1
#define NVIC_ISER_SETENA15(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA15_SHIFT))&NVIC_ISER_SETENA15_MASK)
#define NVIC_ISER_SETENA16_MASK                  0x10000u
#define NVIC_ISER_SETENA16_SHIFT                 16
#define NVIC_ISER_SETENA16_WIDTH                 1
#define NVIC_ISER_SETENA16(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA16_SHIFT))&NVIC_ISER_SETENA16_MASK)
#define NVIC_ISER_SETENA17_MASK                  0x20000u
#define NVIC_ISER_SETENA17_SHIFT                 17
#define NVIC_ISER_SETENA17_WIDTH                 1
#define NVIC_ISER_SETENA17(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA17_SHIFT))&NVIC_ISER_SETENA17_MASK)
#define NVIC_ISER_SETENA18_MASK                  0x40000u
#define NVIC_ISER_SETENA18_SHIFT                 18
#define NVIC_ISER_SETENA18_WIDTH                 1
#define NVIC_ISER_SETENA18(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA18_SHIFT))&NVIC_ISER_SETENA18_MASK)
#define NVIC_ISER_SETENA19_MASK                  0x80000u
#define NVIC_ISER_SETENA19_SHIFT                 19
#define NVIC_ISER_SETENA19_WIDTH                 1
#define NVIC_ISER_SETENA19(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA19_SHIFT))&NVIC_ISER_SETENA19_MASK)
#define NVIC_ISER_SETENA20_MASK                  0x100000u
#define NVIC_ISER_SETENA20_SHIFT                 20
#define NVIC_ISER_SETENA20_WIDTH                 1
#define NVIC_ISER_SETENA20(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA20_SHIFT))&NVIC_ISER_SETENA20_MASK)
#define NVIC_ISER_SETENA21_MASK                  0x200000u
#define NVIC_ISER_SETENA21_SHIFT                 21
#define NVIC_ISER_SETENA21_WIDTH                 1
#define NVIC_ISER_SETENA21(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA21_SHIFT))&NVIC_ISER_SETENA21_MASK)
#define NVIC_ISER_SETENA22_MASK                  0x400000u
#define NVIC_ISER_SETENA22_SHIFT                 22
#define NVIC_ISER_SETENA22_WIDTH                 1
#define NVIC_ISER_SETENA22(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA22_SHIFT))&NVIC_ISER_SETENA22_MASK)
#define NVIC_ISER_SETENA23_MASK                  0x800000u
#define NVIC_ISER_SETENA23_SHIFT                 23
#define NVIC_ISER_SETENA23_WIDTH                 1
#define NVIC_ISER_SETENA23(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA23_SHIFT))&NVIC_ISER_SETENA23_MASK)
#define NVIC_ISER_SETENA24_MASK                  0x1000000u
#define NVIC_ISER_SETENA24_SHIFT                 24
#define NVIC_ISER_SETENA24_WIDTH                 1
#define NVIC_ISER_SETENA24(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA24_SHIFT))&NVIC_ISER_SETENA24_MASK)
#define NVIC_ISER_SETENA25_MASK                  0x2000000u
#define NVIC_ISER_SETENA25_SHIFT                 25
#define NVIC_ISER_SETENA25_WIDTH                 1
#define NVIC_ISER_SETENA25(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA25_SHIFT))&NVIC_ISER_SETENA25_MASK)
#define NVIC_ISER_SETENA26_MASK                  0x4000000u
#define NVIC_ISER_SETENA26_SHIFT                 26
#define NVIC_ISER_SETENA26_WIDTH                 1
#define NVIC_ISER_SETENA26(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA26_SHIFT))&NVIC_ISER_SETENA26_MASK)
#define NVIC_ISER_SETENA27_MASK                  0x8000000u
#define NVIC_ISER_SETENA27_SHIFT                 27
#define NVIC_ISER_SETENA27_WIDTH                 1
#define NVIC_ISER_SETENA27(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA27_SHIFT))&NVIC_ISER_SETENA27_MASK)
#define NVIC_ISER_SETENA28_MASK                  0x10000000u
#define NVIC_ISER_SETENA28_SHIFT                 28
#define NVIC_ISER_SETENA28_WIDTH                 1
#define NVIC_ISER_SETENA28(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA28_SHIFT))&NVIC_ISER_SETENA28_MASK)
#define NVIC_ISER_SETENA29_MASK                  0x20000000u
#define NVIC_ISER_SETENA29_SHIFT                 29
#define NVIC_ISER_SETENA29_WIDTH                 1
#define NVIC_ISER_SETENA29(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA29_SHIFT))&NVIC_ISER_SETENA29_MASK)
#define NVIC_ISER_SETENA30_MASK                  0x40000000u
#define NVIC_ISER_SETENA30_SHIFT                 30
#define NVIC_ISER_SETENA30_WIDTH                 1
#define NVIC_ISER_SETENA30(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA30_SHIFT))&NVIC_ISER_SETENA30_MASK)
#define NVIC_ISER_SETENA31_MASK                  0x80000000u
#define NVIC_ISER_SETENA31_SHIFT                 31
#define NVIC_ISER_SETENA31_WIDTH                 1
#define NVIC_ISER_SETENA31(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA31_SHIFT))&NVIC_ISER_SETENA31_MASK)
/* ICER Bit Fields */
#define NVIC_ICER_CLRENA0_MASK                   0x1u
#define NVIC_ICER_CLRENA0_SHIFT                  0
#define NVIC_ICER_CLRENA0_WIDTH                  1
#define NVIC_ICER_CLRENA0(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA0_SHIFT))&NVIC_ICER_CLRENA0_MASK)
#define NVIC_ICER_CLRENA1_MASK                   0x2u
#define NVIC_ICER_CLRENA1_SHIFT                  1
#define NVIC_ICER_CLRENA1_WIDTH                  1
#define NVIC_ICER_CLRENA1(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA1_SHIFT))&NVIC_ICER_CLRENA1_MASK)
#define NVIC_ICER_CLRENA2_MASK                   0x4u
#define NVIC_ICER_CLRENA2_SHIFT                  2
#define NVIC_ICER_CLRENA2_WIDTH                  1
#define NVIC_ICER_CLRENA2(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA2_SHIFT))&NVIC_ICER_CLRENA2_MASK)
#define NVIC_ICER_CLRENA3_MASK                   0x8u
#define NVIC_ICER_CLRENA3_SHIFT                  3
#define NVIC_ICER_CLRENA3_WIDTH                  1
#define NVIC_ICER_CLRENA3(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA3_SHIFT))&NVIC_ICER_CLRENA3_MASK)
#define NVIC_ICER_CLRENA4_MASK                   0x10u
#define NVIC_ICER_CLRENA4_SHIFT                  4
#define NVIC_ICER_CLRENA4_WIDTH                  1
#define NVIC_ICER_CLRENA4(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA4_SHIFT))&NVIC_ICER_CLRENA4_MASK)
#define NVIC_ICER_CLRENA5_MASK                   0x20u
#define NVIC_ICER_CLRENA5_SHIFT                  5
#define NVIC_ICER_CLRENA5_WIDTH                  1
#define NVIC_ICER_CLRENA5(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA5_SHIFT))&NVIC_ICER_CLRENA5_MASK)
#define NVIC_ICER_CLRENA6_MASK                   0x40u
#define NVIC_ICER_CLRENA6_SHIFT                  6
#define NVIC_ICER_CLRENA6_WIDTH                  1
#define NVIC_ICER_CLRENA6(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA6_SHIFT))&NVIC_ICER_CLRENA6_MASK)
#define NVIC_ICER_CLRENA7_MASK                   0x80u
#define NVIC_ICER_CLRENA7_SHIFT                  7
#define NVIC_ICER_CLRENA7_WIDTH                  1
#define NVIC_ICER_CLRENA7(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA7_SHIFT))&NVIC_ICER_CLRENA7_MASK)
#define NVIC_ICER_CLRENA8_MASK                   0x100u
#define NVIC_ICER_CLRENA8_SHIFT                  8
#define NVIC_ICER_CLRENA8_WIDTH                  1
#define NVIC_ICER_CLRENA8(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA8_SHIFT))&NVIC_ICER_CLRENA8_MASK)
#define NVIC_ICER_CLRENA9_MASK                   0x200u
#define NVIC_ICER_CLRENA9_SHIFT                  9
#define NVIC_ICER_CLRENA9_WIDTH                  1
#define NVIC_ICER_CLRENA9(x)                     (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA9_SHIFT))&NVIC_ICER_CLRENA9_MASK)
#define NVIC_ICER_CLRENA10_MASK                  0x400u
#define NVIC_ICER_CLRENA10_SHIFT                 10
#define NVIC_ICER_CLRENA10_WIDTH                 1
#define NVIC_ICER_CLRENA10(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA10_SHIFT))&NVIC_ICER_CLRENA10_MASK)
#define NVIC_ICER_CLRENA11_MASK                  0x800u
#define NVIC_ICER_CLRENA11_SHIFT                 11
#define NVIC_ICER_CLRENA11_WIDTH                 1
#define NVIC_ICER_CLRENA11(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA11_SHIFT))&NVIC_ICER_CLRENA11_MASK)
#define NVIC_ICER_CLRENA12_MASK                  0x1000u
#define NVIC_ICER_CLRENA12_SHIFT                 12
#define NVIC_ICER_CLRENA12_WIDTH                 1
#define NVIC_ICER_CLRENA12(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA12_SHIFT))&NVIC_ICER_CLRENA12_MASK)
#define NVIC_ICER_CLRENA13_MASK                  0x2000u
#define NVIC_ICER_CLRENA13_SHIFT                 13
#define NVIC_ICER_CLRENA13_WIDTH                 1
#define NVIC_ICER_CLRENA13(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA13_SHIFT))&NVIC_ICER_CLRENA13_MASK)
#define NVIC_ICER_CLRENA14_MASK                  0x4000u
#define NVIC_ICER_CLRENA14_SHIFT                 14
#define NVIC_ICER_CLRENA14_WIDTH                 1
#define NVIC_ICER_CLRENA14(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA14_SHIFT))&NVIC_ICER_CLRENA14_MASK)
#define NVIC_ICER_CLRENA15_MASK                  0x8000u
#define NVIC_ICER_CLRENA15_SHIFT                 15
#define NVIC_ICER_CLRENA15_WIDTH                 1
#define NVIC_ICER_CLRENA15(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA15_SHIFT))&NVIC_ICER_CLRENA15_MASK)
#define NVIC_ICER_CLRENA16_MASK                  0x10000u
#define NVIC_ICER_CLRENA16_SHIFT                 16
#define NVIC_ICER_CLRENA16_WIDTH                 1
#define NVIC_ICER_CLRENA16(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA16_SHIFT))&NVIC_ICER_CLRENA16_MASK)
#define NVIC_ICER_CLRENA17_MASK                  0x20000u
#define NVIC_ICER_CLRENA17_SHIFT                 17
#define NVIC_ICER_CLRENA17_WIDTH                 1
#define NVIC_ICER_CLRENA17(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA17_SHIFT))&NVIC_ICER_CLRENA17_MASK)
#define NVIC_ICER_CLRENA18_MASK                  0x40000u
#define NVIC_ICER_CLRENA18_SHIFT                 18
#define NVIC_ICER_CLRENA18_WIDTH                 1
#define NVIC_ICER_CLRENA18(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA18_SHIFT))&NVIC_ICER_CLRENA18_MASK)
#define NVIC_ICER_CLRENA19_MASK                  0x80000u
#define NVIC_ICER_CLRENA19_SHIFT                 19
#define NVIC_ICER_CLRENA19_WIDTH                 1
#define NVIC_ICER_CLRENA19(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA19_SHIFT))&NVIC_ICER_CLRENA19_MASK)
#define NVIC_ICER_CLRENA20_MASK                  0x100000u
#define NVIC_ICER_CLRENA20_SHIFT                 20
#define NVIC_ICER_CLRENA20_WIDTH                 1
#define NVIC_ICER_CLRENA20(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA20_SHIFT))&NVIC_ICER_CLRENA20_MASK)
#define NVIC_ICER_CLRENA21_MASK                  0x200000u
#define NVIC_ICER_CLRENA21_SHIFT                 21
#define NVIC_ICER_CLRENA21_WIDTH                 1
#define NVIC_ICER_CLRENA21(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA21_SHIFT))&NVIC_ICER_CLRENA21_MASK)
#define NVIC_ICER_CLRENA22_MASK                  0x400000u
#define NVIC_ICER_CLRENA22_SHIFT                 22
#define NVIC_ICER_CLRENA22_WIDTH                 1
#define NVIC_ICER_CLRENA22(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA22_SHIFT))&NVIC_ICER_CLRENA22_MASK)
#define NVIC_ICER_CLRENA23_MASK                  0x800000u
#define NVIC_ICER_CLRENA23_SHIFT                 23
#define NVIC_ICER_CLRENA23_WIDTH                 1
#define NVIC_ICER_CLRENA23(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA23_SHIFT))&NVIC_ICER_CLRENA23_MASK)
#define NVIC_ICER_CLRENA24_MASK                  0x1000000u
#define NVIC_ICER_CLRENA24_SHIFT                 24
#define NVIC_ICER_CLRENA24_WIDTH                 1
#define NVIC_ICER_CLRENA24(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA24_SHIFT))&NVIC_ICER_CLRENA24_MASK)
#define NVIC_ICER_CLRENA25_MASK                  0x2000000u
#define NVIC_ICER_CLRENA25_SHIFT                 25
#define NVIC_ICER_CLRENA25_WIDTH                 1
#define NVIC_ICER_CLRENA25(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA25_SHIFT))&NVIC_ICER_CLRENA25_MASK)
#define NVIC_ICER_CLRENA26_MASK                  0x4000000u
#define NVIC_ICER_CLRENA26_SHIFT                 26
#define NVIC_ICER_CLRENA26_WIDTH                 1
#define NVIC_ICER_CLRENA26(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA26_SHIFT))&NVIC_ICER_CLRENA26_MASK)
#define NVIC_ICER_CLRENA27_MASK                  0x8000000u
#define NVIC_ICER_CLRENA27_SHIFT                 27
#define NVIC_ICER_CLRENA27_WIDTH                 1
#define NVIC_ICER_CLRENA27(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA27_SHIFT))&NVIC_ICER_CLRENA27_MASK)
#define NVIC_ICER_CLRENA28_MASK                  0x10000000u
#define NVIC_ICER_CLRENA28_SHIFT                 28
#define NVIC_ICER_CLRENA28_WIDTH                 1
#define NVIC_ICER_CLRENA28(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA28_SHIFT))&NVIC_ICER_CLRENA28_MASK)
#define NVIC_ICER_CLRENA29_MASK                  0x20000000u
#define NVIC_ICER_CLRENA29_SHIFT                 29
#define NVIC_ICER_CLRENA29_WIDTH                 1
#define NVIC_ICER_CLRENA29(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA29_SHIFT))&NVIC_ICER_CLRENA29_MASK)
#define NVIC_ICER_CLRENA30_MASK                  0x40000000u
#define NVIC_ICER_CLRENA30_SHIFT                 30
#define NVIC_ICER_CLRENA30_WIDTH                 1
#define NVIC_ICER_CLRENA30(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA30_SHIFT))&NVIC_ICER_CLRENA30_MASK)
#define NVIC_ICER_CLRENA31_MASK                  0x80000000u
#define NVIC_ICER_CLRENA31_SHIFT                 31
#define NVIC_ICER_CLRENA31_WIDTH                 1
#define NVIC_ICER_CLRENA31(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA31_SHIFT))&NVIC_ICER_CLRENA31_MASK)
/* ISPR Bit Fields */
#define NVIC_ISPR_SETPEND0_MASK                  0x1u
#define NVIC_ISPR_SETPEND0_SHIFT                 0
#define NVIC_ISPR_SETPEND0_WIDTH                 1
#define NVIC_ISPR_SETPEND0(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND0_SHIFT))&NVIC_ISPR_SETPEND0_MASK)
#define NVIC_ISPR_SETPEND1_MASK                  0x2u
#define NVIC_ISPR_SETPEND1_SHIFT                 1
#define NVIC_ISPR_SETPEND1_WIDTH                 1
#define NVIC_ISPR_SETPEND1(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND1_SHIFT))&NVIC_ISPR_SETPEND1_MASK)
#define NVIC_ISPR_SETPEND2_MASK                  0x4u
#define NVIC_ISPR_SETPEND2_SHIFT                 2
#define NVIC_ISPR_SETPEND2_WIDTH                 1
#define NVIC_ISPR_SETPEND2(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND2_SHIFT))&NVIC_ISPR_SETPEND2_MASK)
#define NVIC_ISPR_SETPEND3_MASK                  0x8u
#define NVIC_ISPR_SETPEND3_SHIFT                 3
#define NVIC_ISPR_SETPEND3_WIDTH                 1
#define NVIC_ISPR_SETPEND3(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND3_SHIFT))&NVIC_ISPR_SETPEND3_MASK)
#define NVIC_ISPR_SETPEND4_MASK                  0x10u
#define NVIC_ISPR_SETPEND4_SHIFT                 4
#define NVIC_ISPR_SETPEND4_WIDTH                 1
