ErichStyger/mcuoneclipse/Examples/KDS/FRDM-KE02Z/FRDM-KE02Z/Static_Code/IO_Map/MKE02Z2.h
#define NVIC_ISPR_SETPEND4(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND4_SHIFT))&NVIC_ISPR_SETPEND4_MASK)
#define NVIC_ISPR_SETPEND5_MASK                  0x20u
#define NVIC_ISPR_SETPEND5_SHIFT                 5
#define NVIC_ISPR_SETPEND5_WIDTH                 1
#define NVIC_ISPR_SETPEND5(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND5_SHIFT))&NVIC_ISPR_SETPEND5_MASK)
#define NVIC_ISPR_SETPEND6_MASK                  0x40u
#define NVIC_ISPR_SETPEND6_SHIFT                 6
#define NVIC_ISPR_SETPEND6_WIDTH                 1
#define NVIC_ISPR_SETPEND6(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND6_SHIFT))&NVIC_ISPR_SETPEND6_MASK)
#define NVIC_ISPR_SETPEND7_MASK                  0x80u
#define NVIC_ISPR_SETPEND7_SHIFT                 7
#define NVIC_ISPR_SETPEND7_WIDTH                 1
#define NVIC_ISPR_SETPEND7(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND7_SHIFT))&NVIC_ISPR_SETPEND7_MASK)
#define NVIC_ISPR_SETPEND8_MASK                  0x100u
#define NVIC_ISPR_SETPEND8_SHIFT                 8
#define NVIC_ISPR_SETPEND8_WIDTH                 1
#define NVIC_ISPR_SETPEND8(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND8_SHIFT))&NVIC_ISPR_SETPEND8_MASK)
#define NVIC_ISPR_SETPEND9_MASK                  0x200u
#define NVIC_ISPR_SETPEND9_SHIFT                 9
#define NVIC_ISPR_SETPEND9_WIDTH                 1
#define NVIC_ISPR_SETPEND9(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND9_SHIFT))&NVIC_ISPR_SETPEND9_MASK)
#define NVIC_ISPR_SETPEND10_MASK                 0x400u
#define NVIC_ISPR_SETPEND10_SHIFT                10
#define NVIC_ISPR_SETPEND10_WIDTH                1
#define NVIC_ISPR_SETPEND10(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND10_SHIFT))&NVIC_ISPR_SETPEND10_MASK)
#define NVIC_ISPR_SETPEND11_MASK                 0x800u
#define NVIC_ISPR_SETPEND11_SHIFT                11
#define NVIC_ISPR_SETPEND11_WIDTH                1
#define NVIC_ISPR_SETPEND11(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND11_SHIFT))&NVIC_ISPR_SETPEND11_MASK)
#define NVIC_ISPR_SETPEND12_MASK                 0x1000u
#define NVIC_ISPR_SETPEND12_SHIFT                12
#define NVIC_ISPR_SETPEND12_WIDTH                1
#define NVIC_ISPR_SETPEND12(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND12_SHIFT))&NVIC_ISPR_SETPEND12_MASK)
#define NVIC_ISPR_SETPEND13_MASK                 0x2000u
#define NVIC_ISPR_SETPEND13_SHIFT                13
#define NVIC_ISPR_SETPEND13_WIDTH                1
#define NVIC_ISPR_SETPEND13(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND13_SHIFT))&NVIC_ISPR_SETPEND13_MASK)
#define NVIC_ISPR_SETPEND14_MASK                 0x4000u
#define NVIC_ISPR_SETPEND14_SHIFT                14
#define NVIC_ISPR_SETPEND14_WIDTH                1
#define NVIC_ISPR_SETPEND14(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND14_SHIFT))&NVIC_ISPR_SETPEND14_MASK)
#define NVIC_ISPR_SETPEND15_MASK                 0x8000u
#define NVIC_ISPR_SETPEND15_SHIFT                15
#define NVIC_ISPR_SETPEND15_WIDTH                1
#define NVIC_ISPR_SETPEND15(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND15_SHIFT))&NVIC_ISPR_SETPEND15_MASK)
#define NVIC_ISPR_SETPEND16_MASK                 0x10000u
#define NVIC_ISPR_SETPEND16_SHIFT                16
#define NVIC_ISPR_SETPEND16_WIDTH                1
#define NVIC_ISPR_SETPEND16(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND16_SHIFT))&NVIC_ISPR_SETPEND16_MASK)
#define NVIC_ISPR_SETPEND17_MASK                 0x20000u
#define NVIC_ISPR_SETPEND17_SHIFT                17
#define NVIC_ISPR_SETPEND17_WIDTH                1
#define NVIC_ISPR_SETPEND17(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND17_SHIFT))&NVIC_ISPR_SETPEND17_MASK)
#define NVIC_ISPR_SETPEND18_MASK                 0x40000u
#define NVIC_ISPR_SETPEND18_SHIFT                18
#define NVIC_ISPR_SETPEND18_WIDTH                1
#define NVIC_ISPR_SETPEND18(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND18_SHIFT))&NVIC_ISPR_SETPEND18_MASK)
#define NVIC_ISPR_SETPEND19_MASK                 0x80000u
#define NVIC_ISPR_SETPEND19_SHIFT                19
#define NVIC_ISPR_SETPEND19_WIDTH                1
#define NVIC_ISPR_SETPEND19(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND19_SHIFT))&NVIC_ISPR_SETPEND19_MASK)
#define NVIC_ISPR_SETPEND20_MASK                 0x100000u
#define NVIC_ISPR_SETPEND20_SHIFT                20
#define NVIC_ISPR_SETPEND20_WIDTH                1
#define NVIC_ISPR_SETPEND20(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND20_SHIFT))&NVIC_ISPR_SETPEND20_MASK)
#define NVIC_ISPR_SETPEND21_MASK                 0x200000u
#define NVIC_ISPR_SETPEND21_SHIFT                21
#define NVIC_ISPR_SETPEND21_WIDTH                1
#define NVIC_ISPR_SETPEND21(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND21_SHIFT))&NVIC_ISPR_SETPEND21_MASK)
#define NVIC_ISPR_SETPEND22_MASK                 0x400000u
#define NVIC_ISPR_SETPEND22_SHIFT                22
#define NVIC_ISPR_SETPEND22_WIDTH                1
#define NVIC_ISPR_SETPEND22(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND22_SHIFT))&NVIC_ISPR_SETPEND22_MASK)
#define NVIC_ISPR_SETPEND23_MASK                 0x800000u
#define NVIC_ISPR_SETPEND23_SHIFT                23
#define NVIC_ISPR_SETPEND23_WIDTH                1
#define NVIC_ISPR_SETPEND23(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND23_SHIFT))&NVIC_ISPR_SETPEND23_MASK)
#define NVIC_ISPR_SETPEND24_MASK                 0x1000000u
#define NVIC_ISPR_SETPEND24_SHIFT                24
#define NVIC_ISPR_SETPEND24_WIDTH                1
#define NVIC_ISPR_SETPEND24(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND24_SHIFT))&NVIC_ISPR_SETPEND24_MASK)
#define NVIC_ISPR_SETPEND25_MASK                 0x2000000u
#define NVIC_ISPR_SETPEND25_SHIFT                25
#define NVIC_ISPR_SETPEND25_WIDTH                1
#define NVIC_ISPR_SETPEND25(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND25_SHIFT))&NVIC_ISPR_SETPEND25_MASK)
#define NVIC_ISPR_SETPEND26_MASK                 0x4000000u
#define NVIC_ISPR_SETPEND26_SHIFT                26
#define NVIC_ISPR_SETPEND26_WIDTH                1
#define NVIC_ISPR_SETPEND26(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND26_SHIFT))&NVIC_ISPR_SETPEND26_MASK)
#define NVIC_ISPR_SETPEND27_MASK                 0x8000000u
#define NVIC_ISPR_SETPEND27_SHIFT                27
#define NVIC_ISPR_SETPEND27_WIDTH                1
#define NVIC_ISPR_SETPEND27(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND27_SHIFT))&NVIC_ISPR_SETPEND27_MASK)
#define NVIC_ISPR_SETPEND28_MASK                 0x10000000u
#define NVIC_ISPR_SETPEND28_SHIFT                28
#define NVIC_ISPR_SETPEND28_WIDTH                1
#define NVIC_ISPR_SETPEND28(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND28_SHIFT))&NVIC_ISPR_SETPEND28_MASK)
#define NVIC_ISPR_SETPEND29_MASK                 0x20000000u
#define NVIC_ISPR_SETPEND29_SHIFT                29
#define NVIC_ISPR_SETPEND29_WIDTH                1
#define NVIC_ISPR_SETPEND29(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND29_SHIFT))&NVIC_ISPR_SETPEND29_MASK)
#define NVIC_ISPR_SETPEND30_MASK                 0x40000000u
#define NVIC_ISPR_SETPEND30_SHIFT                30
#define NVIC_ISPR_SETPEND30_WIDTH                1
#define NVIC_ISPR_SETPEND30(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND30_SHIFT))&NVIC_ISPR_SETPEND30_MASK)
#define NVIC_ISPR_SETPEND31_MASK                 0x80000000u
#define NVIC_ISPR_SETPEND31_SHIFT                31
#define NVIC_ISPR_SETPEND31_WIDTH                1
#define NVIC_ISPR_SETPEND31(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND31_SHIFT))&NVIC_ISPR_SETPEND31_MASK)
/* ICPR Bit Fields */
#define NVIC_ICPR_CLRPEND0_MASK                  0x1u
#define NVIC_ICPR_CLRPEND0_SHIFT                 0
#define NVIC_ICPR_CLRPEND0_WIDTH                 1
#define NVIC_ICPR_CLRPEND0(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND0_SHIFT))&NVIC_ICPR_CLRPEND0_MASK)
#define NVIC_ICPR_CLRPEND1_MASK                  0x2u
#define NVIC_ICPR_CLRPEND1_SHIFT                 1
#define NVIC_ICPR_CLRPEND1_WIDTH                 1
#define NVIC_ICPR_CLRPEND1(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND1_SHIFT))&NVIC_ICPR_CLRPEND1_MASK)
#define NVIC_ICPR_CLRPEND2_MASK                  0x4u
#define NVIC_ICPR_CLRPEND2_SHIFT                 2
#define NVIC_ICPR_CLRPEND2_WIDTH                 1
#define NVIC_ICPR_CLRPEND2(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND2_SHIFT))&NVIC_ICPR_CLRPEND2_MASK)
#define NVIC_ICPR_CLRPEND3_MASK                  0x8u
#define NVIC_ICPR_CLRPEND3_SHIFT                 3
#define NVIC_ICPR_CLRPEND3_WIDTH                 1
#define NVIC_ICPR_CLRPEND3(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND3_SHIFT))&NVIC_ICPR_CLRPEND3_MASK)
#define NVIC_ICPR_CLRPEND4_MASK                  0x10u
#define NVIC_ICPR_CLRPEND4_SHIFT                 4
#define NVIC_ICPR_CLRPEND4_WIDTH                 1
#define NVIC_ICPR_CLRPEND4(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND4_SHIFT))&NVIC_ICPR_CLRPEND4_MASK)
#define NVIC_ICPR_CLRPEND5_MASK                  0x20u
#define NVIC_ICPR_CLRPEND5_SHIFT                 5
#define NVIC_ICPR_CLRPEND5_WIDTH                 1
#define NVIC_ICPR_CLRPEND5(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND5_SHIFT))&NVIC_ICPR_CLRPEND5_MASK)
#define NVIC_ICPR_CLRPEND6_MASK                  0x40u
#define NVIC_ICPR_CLRPEND6_SHIFT                 6
#define NVIC_ICPR_CLRPEND6_WIDTH                 1
#define NVIC_ICPR_CLRPEND6(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND6_SHIFT))&NVIC_ICPR_CLRPEND6_MASK)
#define NVIC_ICPR_CLRPEND7_MASK                  0x80u
#define NVIC_ICPR_CLRPEND7_SHIFT                 7
#define NVIC_ICPR_CLRPEND7_WIDTH                 1
#define NVIC_ICPR_CLRPEND7(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND7_SHIFT))&NVIC_ICPR_CLRPEND7_MASK)
#define NVIC_ICPR_CLRPEND8_MASK                  0x100u
#define NVIC_ICPR_CLRPEND8_SHIFT                 8
#define NVIC_ICPR_CLRPEND8_WIDTH                 1
#define NVIC_ICPR_CLRPEND8(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND8_SHIFT))&NVIC_ICPR_CLRPEND8_MASK)
#define NVIC_ICPR_CLRPEND9_MASK                  0x200u
#define NVIC_ICPR_CLRPEND9_SHIFT                 9
#define NVIC_ICPR_CLRPEND9_WIDTH                 1
#define NVIC_ICPR_CLRPEND9(x)                    (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND9_SHIFT))&NVIC_ICPR_CLRPEND9_MASK)
#define NVIC_ICPR_CLRPEND10_MASK                 0x400u
#define NVIC_ICPR_CLRPEND10_SHIFT                10
#define NVIC_ICPR_CLRPEND10_WIDTH                1
#define NVIC_ICPR_CLRPEND10(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND10_SHIFT))&NVIC_ICPR_CLRPEND10_MASK)
#define NVIC_ICPR_CLRPEND11_MASK                 0x800u
#define NVIC_ICPR_CLRPEND11_SHIFT                11
#define NVIC_ICPR_CLRPEND11_WIDTH                1
#define NVIC_ICPR_CLRPEND11(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND11_SHIFT))&NVIC_ICPR_CLRPEND11_MASK)
#define NVIC_ICPR_CLRPEND12_MASK                 0x1000u
#define NVIC_ICPR_CLRPEND12_SHIFT                12
#define NVIC_ICPR_CLRPEND12_WIDTH                1
#define NVIC_ICPR_CLRPEND12(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND12_SHIFT))&NVIC_ICPR_CLRPEND12_MASK)
#define NVIC_ICPR_CLRPEND13_MASK                 0x2000u
#define NVIC_ICPR_CLRPEND13_SHIFT                13
#define NVIC_ICPR_CLRPEND13_WIDTH                1
#define NVIC_ICPR_CLRPEND13(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND13_SHIFT))&NVIC_ICPR_CLRPEND13_MASK)
#define NVIC_ICPR_CLRPEND14_MASK                 0x4000u
#define NVIC_ICPR_CLRPEND14_SHIFT                14
#define NVIC_ICPR_CLRPEND14_WIDTH                1
#define NVIC_ICPR_CLRPEND14(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND14_SHIFT))&NVIC_ICPR_CLRPEND14_MASK)
#define NVIC_ICPR_CLRPEND15_MASK                 0x8000u
#define NVIC_ICPR_CLRPEND15_SHIFT                15
#define NVIC_ICPR_CLRPEND15_WIDTH                1
#define NVIC_ICPR_CLRPEND15(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND15_SHIFT))&NVIC_ICPR_CLRPEND15_MASK)
#define NVIC_ICPR_CLRPEND16_MASK                 0x10000u
#define NVIC_ICPR_CLRPEND16_SHIFT                16
#define NVIC_ICPR_CLRPEND16_WIDTH                1
#define NVIC_ICPR_CLRPEND16(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND16_SHIFT))&NVIC_ICPR_CLRPEND16_MASK)
#define NVIC_ICPR_CLRPEND17_MASK                 0x20000u
#define NVIC_ICPR_CLRPEND17_SHIFT                17
#define NVIC_ICPR_CLRPEND17_WIDTH                1
#define NVIC_ICPR_CLRPEND17(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND17_SHIFT))&NVIC_ICPR_CLRPEND17_MASK)
#define NVIC_ICPR_CLRPEND18_MASK                 0x40000u
#define NVIC_ICPR_CLRPEND18_SHIFT                18
#define NVIC_ICPR_CLRPEND18_WIDTH                1
#define NVIC_ICPR_CLRPEND18(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND18_SHIFT))&NVIC_ICPR_CLRPEND18_MASK)
#define NVIC_ICPR_CLRPEND19_MASK                 0x80000u
#define NVIC_ICPR_CLRPEND19_SHIFT                19
#define NVIC_ICPR_CLRPEND19_WIDTH                1
#define NVIC_ICPR_CLRPEND19(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND19_SHIFT))&NVIC_ICPR_CLRPEND19_MASK)
#define NVIC_ICPR_CLRPEND20_MASK                 0x100000u
#define NVIC_ICPR_CLRPEND20_SHIFT                20
#define NVIC_ICPR_CLRPEND20_WIDTH                1
#define NVIC_ICPR_CLRPEND20(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND20_SHIFT))&NVIC_ICPR_CLRPEND20_MASK)
#define NVIC_ICPR_CLRPEND21_MASK                 0x200000u
#define NVIC_ICPR_CLRPEND21_SHIFT                21
#define NVIC_ICPR_CLRPEND21_WIDTH                1
#define NVIC_ICPR_CLRPEND21(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND21_SHIFT))&NVIC_ICPR_CLRPEND21_MASK)
#define NVIC_ICPR_CLRPEND22_MASK                 0x400000u
#define NVIC_ICPR_CLRPEND22_SHIFT                22
#define NVIC_ICPR_CLRPEND22_WIDTH                1
#define NVIC_ICPR_CLRPEND22(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND22_SHIFT))&NVIC_ICPR_CLRPEND22_MASK)
#define NVIC_ICPR_CLRPEND23_MASK                 0x800000u
#define NVIC_ICPR_CLRPEND23_SHIFT                23
#define NVIC_ICPR_CLRPEND23_WIDTH                1
#define NVIC_ICPR_CLRPEND23(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND23_SHIFT))&NVIC_ICPR_CLRPEND23_MASK)
#define NVIC_ICPR_CLRPEND24_MASK                 0x1000000u
#define NVIC_ICPR_CLRPEND24_SHIFT                24
#define NVIC_ICPR_CLRPEND24_WIDTH                1
#define NVIC_ICPR_CLRPEND24(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND24_SHIFT))&NVIC_ICPR_CLRPEND24_MASK)
#define NVIC_ICPR_CLRPEND25_MASK                 0x2000000u
#define NVIC_ICPR_CLRPEND25_SHIFT                25
#define NVIC_ICPR_CLRPEND25_WIDTH                1
#define NVIC_ICPR_CLRPEND25(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND25_SHIFT))&NVIC_ICPR_CLRPEND25_MASK)
#define NVIC_ICPR_CLRPEND26_MASK                 0x4000000u
#define NVIC_ICPR_CLRPEND26_SHIFT                26
#define NVIC_ICPR_CLRPEND26_WIDTH                1
#define NVIC_ICPR_CLRPEND26(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND26_SHIFT))&NVIC_ICPR_CLRPEND26_MASK)
#define NVIC_ICPR_CLRPEND27_MASK                 0x8000000u
#define NVIC_ICPR_CLRPEND27_SHIFT                27
#define NVIC_ICPR_CLRPEND27_WIDTH                1
#define NVIC_ICPR_CLRPEND27(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND27_SHIFT))&NVIC_ICPR_CLRPEND27_MASK)
#define NVIC_ICPR_CLRPEND28_MASK                 0x10000000u
#define NVIC_ICPR_CLRPEND28_SHIFT                28
#define NVIC_ICPR_CLRPEND28_WIDTH                1
#define NVIC_ICPR_CLRPEND28(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND28_SHIFT))&NVIC_ICPR_CLRPEND28_MASK)
#define NVIC_ICPR_CLRPEND29_MASK                 0x20000000u
#define NVIC_ICPR_CLRPEND29_SHIFT                29
#define NVIC_ICPR_CLRPEND29_WIDTH                1
#define NVIC_ICPR_CLRPEND29(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND29_SHIFT))&NVIC_ICPR_CLRPEND29_MASK)
#define NVIC_ICPR_CLRPEND30_MASK                 0x40000000u
#define NVIC_ICPR_CLRPEND30_SHIFT                30
#define NVIC_ICPR_CLRPEND30_WIDTH                1
#define NVIC_ICPR_CLRPEND30(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND30_SHIFT))&NVIC_ICPR_CLRPEND30_MASK)
#define NVIC_ICPR_CLRPEND31_MASK                 0x80000000u
#define NVIC_ICPR_CLRPEND31_SHIFT                31
#define NVIC_ICPR_CLRPEND31_WIDTH                1
#define NVIC_ICPR_CLRPEND31(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND31_SHIFT))&NVIC_ICPR_CLRPEND31_MASK)
/* IP Bit Fields */
#define NVIC_IP_PRI_0_MASK                       0xFFu
#define NVIC_IP_PRI_0_SHIFT                      0
#define NVIC_IP_PRI_0_WIDTH                      8
#define NVIC_IP_PRI_0(x)                         (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_0_SHIFT))&NVIC_IP_PRI_0_MASK)
#define NVIC_IP_PRI_28_MASK                      0xFFu
#define NVIC_IP_PRI_28_SHIFT                     0
#define NVIC_IP_PRI_28_WIDTH                     8
#define NVIC_IP_PRI_28(x)                        (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_28_SHIFT))&NVIC_IP_PRI_28_MASK)
#define NVIC_IP_PRI_24_MASK                      0xFFu
#define NVIC_IP_PRI_24_SHIFT                     0
#define NVIC_IP_PRI_24_WIDTH                     8
#define NVIC_IP_PRI_24(x)                        (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_24_SHIFT))&NVIC_IP_PRI_24_MASK)
#define NVIC_IP_PRI_20_MASK                      0xFFu
#define NVIC_IP_PRI_20_SHIFT                     0
#define NVIC_IP_PRI_20_WIDTH                     8
#define NVIC_IP_PRI_20(x)                        (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_20_SHIFT))&NVIC_IP_PRI_20_MASK)
#define NVIC_IP_PRI_4_MASK                       0xFFu
#define NVIC_IP_PRI_4_SHIFT                      0
#define NVIC_IP_PRI_4_WIDTH                      8
#define NVIC_IP_PRI_4(x)                         (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_4_SHIFT))&NVIC_IP_PRI_4_MASK)
#define NVIC_IP_PRI_16_MASK                      0xFFu
#define NVIC_IP_PRI_16_SHIFT                     0
#define NVIC_IP_PRI_16_WIDTH                     8
#define NVIC_IP_PRI_16(x)                        (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_16_SHIFT))&NVIC_IP_PRI_16_MASK)
#define NVIC_IP_PRI_12_MASK                      0xFFu
#define NVIC_IP_PRI_12_SHIFT                     0
#define NVIC_IP_PRI_12_WIDTH                     8
#define NVIC_IP_PRI_12(x)                        (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_12_SHIFT))&NVIC_IP_PRI_12_MASK)
#define NVIC_IP_PRI_8_MASK                       0xFFu
#define NVIC_IP_PRI_8_SHIFT                      0
#define NVIC_IP_PRI_8_WIDTH                      8
#define NVIC_IP_PRI_8(x)                         (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_8_SHIFT))&NVIC_IP_PRI_8_MASK)
#define NVIC_IP_PRI_13_MASK                      0xFF00u
#define NVIC_IP_PRI_13_SHIFT                     8
#define NVIC_IP_PRI_13_WIDTH                     8
#define NVIC_IP_PRI_13(x)                        (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_13_SHIFT))&NVIC_IP_PRI_13_MASK)
#define NVIC_IP_PRI_21_MASK                      0xFF00u
#define NVIC_IP_PRI_21_SHIFT                     8
#define NVIC_IP_PRI_21_WIDTH                     8
#define NVIC_IP_PRI_21(x)                        (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_21_SHIFT))&NVIC_IP_PRI_21_MASK)
#define NVIC_IP_PRI_29_MASK                      0xFF00u
#define NVIC_IP_PRI_29_SHIFT                     8
#define NVIC_IP_PRI_29_WIDTH                     8
#define NVIC_IP_PRI_29(x)                        (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_29_SHIFT))&NVIC_IP_PRI_29_MASK)
#define NVIC_IP_PRI_1_MASK                       0xFF00u
#define NVIC_IP_PRI_1_SHIFT                      8
#define NVIC_IP_PRI_1_WIDTH                      8
#define NVIC_IP_PRI_1(x)                         (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_1_SHIFT))&NVIC_IP_PRI_1_MASK)
#define NVIC_IP_PRI_9_MASK                       0xFF00u
#define NVIC_IP_PRI_9_SHIFT                      8
#define NVIC_IP_PRI_9_WIDTH                      8
#define NVIC_IP_PRI_9(x)                         (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_9_SHIFT))&NVIC_IP_PRI_9_MASK)
#define NVIC_IP_PRI_17_MASK                      0xFF00u
#define NVIC_IP_PRI_17_SHIFT                     8
#define NVIC_IP_PRI_17_WIDTH                     8
#define NVIC_IP_PRI_17(x)                        (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_17_SHIFT))&NVIC_IP_PRI_17_MASK)
#define NVIC_IP_PRI_25_MASK                      0xFF00u
#define NVIC_IP_PRI_25_SHIFT                     8
#define NVIC_IP_PRI_25_WIDTH                     8
#define NVIC_IP_PRI_25(x)                        (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_25_SHIFT))&NVIC_IP_PRI_25_MASK)
#define NVIC_IP_PRI_5_MASK                       0xFF00u
#define NVIC_IP_PRI_5_SHIFT                      8
#define NVIC_IP_PRI_5_WIDTH                      8
#define NVIC_IP_PRI_5(x)                         (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_5_SHIFT))&NVIC_IP_PRI_5_MASK)
#define NVIC_IP_PRI_2_MASK                       0xFF0000u
#define NVIC_IP_PRI_2_SHIFT                      16
#define NVIC_IP_PRI_2_WIDTH                      8
#define NVIC_IP_PRI_2(x)                         (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_2_SHIFT))&NVIC_IP_PRI_2_MASK)
#define NVIC_IP_PRI_26_MASK                      0xFF0000u
#define NVIC_IP_PRI_26_SHIFT                     16
#define NVIC_IP_PRI_26_WIDTH                     8
#define NVIC_IP_PRI_26(x)                        (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_26_SHIFT))&NVIC_IP_PRI_26_MASK)
#define NVIC_IP_PRI_18_MASK                      0xFF0000u
#define NVIC_IP_PRI_18_SHIFT                     16
#define NVIC_IP_PRI_18_WIDTH                     8
#define NVIC_IP_PRI_18(x)                        (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_18_SHIFT))&NVIC_IP_PRI_18_MASK)
#define NVIC_IP_PRI_14_MASK                      0xFF0000u
#define NVIC_IP_PRI_14_SHIFT                     16
#define NVIC_IP_PRI_14_WIDTH                     8
#define NVIC_IP_PRI_14(x)                        (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_14_SHIFT))&NVIC_IP_PRI_14_MASK)
#define NVIC_IP_PRI_6_MASK                       0xFF0000u
#define NVIC_IP_PRI_6_SHIFT                      16
#define NVIC_IP_PRI_6_WIDTH                      8
#define NVIC_IP_PRI_6(x)                         (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_6_SHIFT))&NVIC_IP_PRI_6_MASK)
#define NVIC_IP_PRI_30_MASK                      0xFF0000u
#define NVIC_IP_PRI_30_SHIFT                     16
#define NVIC_IP_PRI_30_WIDTH                     8
#define NVIC_IP_PRI_30(x)                        (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_30_SHIFT))&NVIC_IP_PRI_30_MASK)
#define NVIC_IP_PRI_22_MASK                      0xFF0000u
#define NVIC_IP_PRI_22_SHIFT                     16
#define NVIC_IP_PRI_22_WIDTH                     8
#define NVIC_IP_PRI_22(x)                        (((uint32_t)(((uint32_t)(x))<<NVIC_IP_PRI_22_SHIFT))&NVIC_IP_PRI_22_MASK)
#define NVIC_IP_PRI_10_MASK                      0xFF0000u
