ErichStyger/mcuoneclipse/Examples/KDS/FRDM-KE02Z/FRDM-KE02Z/Static_Code/IO_Map/MKE02Z2.h
/* IOFLT Bit Fields */
#define PORT_IOFLT_FLTA_MASK                     0x3u
#define PORT_IOFLT_FLTA_SHIFT                    0
#define PORT_IOFLT_FLTA_WIDTH                    2
#define PORT_IOFLT_FLTA(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTA_SHIFT))&PORT_IOFLT_FLTA_MASK)
#define PORT_IOFLT_FLTB_MASK                     0xCu
#define PORT_IOFLT_FLTB_SHIFT                    2
#define PORT_IOFLT_FLTB_WIDTH                    2
#define PORT_IOFLT_FLTB(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTB_SHIFT))&PORT_IOFLT_FLTB_MASK)
#define PORT_IOFLT_FLTC_MASK                     0x30u
#define PORT_IOFLT_FLTC_SHIFT                    4
#define PORT_IOFLT_FLTC_WIDTH                    2
#define PORT_IOFLT_FLTC(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTC_SHIFT))&PORT_IOFLT_FLTC_MASK)
#define PORT_IOFLT_FLTD_MASK                     0xC0u
#define PORT_IOFLT_FLTD_SHIFT                    6
#define PORT_IOFLT_FLTD_WIDTH                    2
#define PORT_IOFLT_FLTD(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTD_SHIFT))&PORT_IOFLT_FLTD_MASK)
#define PORT_IOFLT_FLTE_MASK                     0x300u
#define PORT_IOFLT_FLTE_SHIFT                    8
#define PORT_IOFLT_FLTE_WIDTH                    2
#define PORT_IOFLT_FLTE(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTE_SHIFT))&PORT_IOFLT_FLTE_MASK)
#define PORT_IOFLT_FLTF_MASK                     0xC00u
#define PORT_IOFLT_FLTF_SHIFT                    10
#define PORT_IOFLT_FLTF_WIDTH                    2
#define PORT_IOFLT_FLTF(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTF_SHIFT))&PORT_IOFLT_FLTF_MASK)
#define PORT_IOFLT_FLTG_MASK                     0x3000u
#define PORT_IOFLT_FLTG_SHIFT                    12
#define PORT_IOFLT_FLTG_WIDTH                    2
#define PORT_IOFLT_FLTG(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTG_SHIFT))&PORT_IOFLT_FLTG_MASK)
#define PORT_IOFLT_FLTH_MASK                     0xC000u
#define PORT_IOFLT_FLTH_SHIFT                    14
#define PORT_IOFLT_FLTH_WIDTH                    2
#define PORT_IOFLT_FLTH(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTH_SHIFT))&PORT_IOFLT_FLTH_MASK)
#define PORT_IOFLT_FLTRST_MASK                   0x30000u
#define PORT_IOFLT_FLTRST_SHIFT                  16
#define PORT_IOFLT_FLTRST_WIDTH                  2
#define PORT_IOFLT_FLTRST(x)                     (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTRST_SHIFT))&PORT_IOFLT_FLTRST_MASK)
#define PORT_IOFLT_FLTKBI0_MASK                  0xC0000u
#define PORT_IOFLT_FLTKBI0_SHIFT                 18
#define PORT_IOFLT_FLTKBI0_WIDTH                 2
#define PORT_IOFLT_FLTKBI0(x)                    (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTKBI0_SHIFT))&PORT_IOFLT_FLTKBI0_MASK)
#define PORT_IOFLT_FLTKBI1_MASK                  0x300000u
#define PORT_IOFLT_FLTKBI1_SHIFT                 20
#define PORT_IOFLT_FLTKBI1_WIDTH                 2
#define PORT_IOFLT_FLTKBI1(x)                    (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTKBI1_SHIFT))&PORT_IOFLT_FLTKBI1_MASK)
#define PORT_IOFLT_FLTNMI_MASK                   0xC00000u
#define PORT_IOFLT_FLTNMI_SHIFT                  22
#define PORT_IOFLT_FLTNMI_WIDTH                  2
#define PORT_IOFLT_FLTNMI(x)                     (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTNMI_SHIFT))&PORT_IOFLT_FLTNMI_MASK)
#define PORT_IOFLT_FLTDIV1_MASK                  0x3000000u
#define PORT_IOFLT_FLTDIV1_SHIFT                 24
#define PORT_IOFLT_FLTDIV1_WIDTH                 2
#define PORT_IOFLT_FLTDIV1(x)                    (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTDIV1_SHIFT))&PORT_IOFLT_FLTDIV1_MASK)
#define PORT_IOFLT_FLTDIV2_MASK                  0x1C000000u
#define PORT_IOFLT_FLTDIV2_SHIFT                 26
#define PORT_IOFLT_FLTDIV2_WIDTH                 3
#define PORT_IOFLT_FLTDIV2(x)                    (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTDIV2_SHIFT))&PORT_IOFLT_FLTDIV2_MASK)
#define PORT_IOFLT_FLTDIV3_MASK                  0xE0000000u
#define PORT_IOFLT_FLTDIV3_SHIFT                 29
#define PORT_IOFLT_FLTDIV3_WIDTH                 3
#define PORT_IOFLT_FLTDIV3(x)                    (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTDIV3_SHIFT))&PORT_IOFLT_FLTDIV3_MASK)
/* PUEL Bit Fields */
#define PORT_PUEL_PTAPE0_MASK                    0x1u
#define PORT_PUEL_PTAPE0_SHIFT                   0
#define PORT_PUEL_PTAPE0_WIDTH                   1
#define PORT_PUEL_PTAPE0(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTAPE0_SHIFT))&PORT_PUEL_PTAPE0_MASK)
#define PORT_PUEL_PTAPE1_MASK                    0x2u
#define PORT_PUEL_PTAPE1_SHIFT                   1
#define PORT_PUEL_PTAPE1_WIDTH                   1
#define PORT_PUEL_PTAPE1(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTAPE1_SHIFT))&PORT_PUEL_PTAPE1_MASK)
#define PORT_PUEL_PTAPE2_MASK                    0x4u
#define PORT_PUEL_PTAPE2_SHIFT                   2
#define PORT_PUEL_PTAPE2_WIDTH                   1
#define PORT_PUEL_PTAPE2(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTAPE2_SHIFT))&PORT_PUEL_PTAPE2_MASK)
#define PORT_PUEL_PTAPE3_MASK                    0x8u
#define PORT_PUEL_PTAPE3_SHIFT                   3
#define PORT_PUEL_PTAPE3_WIDTH                   1
#define PORT_PUEL_PTAPE3(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTAPE3_SHIFT))&PORT_PUEL_PTAPE3_MASK)
#define PORT_PUEL_PTAPE4_MASK                    0x10u
#define PORT_PUEL_PTAPE4_SHIFT                   4
#define PORT_PUEL_PTAPE4_WIDTH                   1
#define PORT_PUEL_PTAPE4(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTAPE4_SHIFT))&PORT_PUEL_PTAPE4_MASK)
#define PORT_PUEL_PTAPE5_MASK                    0x20u
#define PORT_PUEL_PTAPE5_SHIFT                   5
#define PORT_PUEL_PTAPE5_WIDTH                   1
#define PORT_PUEL_PTAPE5(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTAPE5_SHIFT))&PORT_PUEL_PTAPE5_MASK)
#define PORT_PUEL_PTAPE6_MASK                    0x40u
#define PORT_PUEL_PTAPE6_SHIFT                   6
#define PORT_PUEL_PTAPE6_WIDTH                   1
#define PORT_PUEL_PTAPE6(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTAPE6_SHIFT))&PORT_PUEL_PTAPE6_MASK)
#define PORT_PUEL_PTAPE7_MASK                    0x80u
#define PORT_PUEL_PTAPE7_SHIFT                   7
#define PORT_PUEL_PTAPE7_WIDTH                   1
#define PORT_PUEL_PTAPE7(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTAPE7_SHIFT))&PORT_PUEL_PTAPE7_MASK)
#define PORT_PUEL_PTBPE0_MASK                    0x100u
#define PORT_PUEL_PTBPE0_SHIFT                   8
#define PORT_PUEL_PTBPE0_WIDTH                   1
#define PORT_PUEL_PTBPE0(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTBPE0_SHIFT))&PORT_PUEL_PTBPE0_MASK)
#define PORT_PUEL_PTBPE1_MASK                    0x200u
#define PORT_PUEL_PTBPE1_SHIFT                   9
#define PORT_PUEL_PTBPE1_WIDTH                   1
#define PORT_PUEL_PTBPE1(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTBPE1_SHIFT))&PORT_PUEL_PTBPE1_MASK)
#define PORT_PUEL_PTBPE2_MASK                    0x400u
#define PORT_PUEL_PTBPE2_SHIFT                   10
#define PORT_PUEL_PTBPE2_WIDTH                   1
#define PORT_PUEL_PTBPE2(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTBPE2_SHIFT))&PORT_PUEL_PTBPE2_MASK)
#define PORT_PUEL_PTBPE3_MASK                    0x800u
#define PORT_PUEL_PTBPE3_SHIFT                   11
#define PORT_PUEL_PTBPE3_WIDTH                   1
#define PORT_PUEL_PTBPE3(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTBPE3_SHIFT))&PORT_PUEL_PTBPE3_MASK)
#define PORT_PUEL_PTBPE4_MASK                    0x1000u
#define PORT_PUEL_PTBPE4_SHIFT                   12
#define PORT_PUEL_PTBPE4_WIDTH                   1
#define PORT_PUEL_PTBPE4(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTBPE4_SHIFT))&PORT_PUEL_PTBPE4_MASK)
#define PORT_PUEL_PTBPE5_MASK                    0x2000u
#define PORT_PUEL_PTBPE5_SHIFT                   13
#define PORT_PUEL_PTBPE5_WIDTH                   1
#define PORT_PUEL_PTBPE5(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTBPE5_SHIFT))&PORT_PUEL_PTBPE5_MASK)
#define PORT_PUEL_PTBPE6_MASK                    0x4000u
#define PORT_PUEL_PTBPE6_SHIFT                   14
#define PORT_PUEL_PTBPE6_WIDTH                   1
#define PORT_PUEL_PTBPE6(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTBPE6_SHIFT))&PORT_PUEL_PTBPE6_MASK)
#define PORT_PUEL_PTBPE7_MASK                    0x8000u
#define PORT_PUEL_PTBPE7_SHIFT                   15
#define PORT_PUEL_PTBPE7_WIDTH                   1
#define PORT_PUEL_PTBPE7(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTBPE7_SHIFT))&PORT_PUEL_PTBPE7_MASK)
#define PORT_PUEL_PTCPE0_MASK                    0x10000u
#define PORT_PUEL_PTCPE0_SHIFT                   16
#define PORT_PUEL_PTCPE0_WIDTH                   1
#define PORT_PUEL_PTCPE0(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTCPE0_SHIFT))&PORT_PUEL_PTCPE0_MASK)
#define PORT_PUEL_PTCPE1_MASK                    0x20000u
#define PORT_PUEL_PTCPE1_SHIFT                   17
#define PORT_PUEL_PTCPE1_WIDTH                   1
#define PORT_PUEL_PTCPE1(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTCPE1_SHIFT))&PORT_PUEL_PTCPE1_MASK)
#define PORT_PUEL_PTCPE2_MASK                    0x40000u
#define PORT_PUEL_PTCPE2_SHIFT                   18
#define PORT_PUEL_PTCPE2_WIDTH                   1
#define PORT_PUEL_PTCPE2(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTCPE2_SHIFT))&PORT_PUEL_PTCPE2_MASK)
#define PORT_PUEL_PTCPE3_MASK                    0x80000u
#define PORT_PUEL_PTCPE3_SHIFT                   19
#define PORT_PUEL_PTCPE3_WIDTH                   1
#define PORT_PUEL_PTCPE3(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTCPE3_SHIFT))&PORT_PUEL_PTCPE3_MASK)
#define PORT_PUEL_PTCPE4_MASK                    0x100000u
#define PORT_PUEL_PTCPE4_SHIFT                   20
#define PORT_PUEL_PTCPE4_WIDTH                   1
#define PORT_PUEL_PTCPE4(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTCPE4_SHIFT))&PORT_PUEL_PTCPE4_MASK)
#define PORT_PUEL_PTCPE5_MASK                    0x200000u
#define PORT_PUEL_PTCPE5_SHIFT                   21
#define PORT_PUEL_PTCPE5_WIDTH                   1
#define PORT_PUEL_PTCPE5(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTCPE5_SHIFT))&PORT_PUEL_PTCPE5_MASK)
#define PORT_PUEL_PTCPE6_MASK                    0x400000u
#define PORT_PUEL_PTCPE6_SHIFT                   22
#define PORT_PUEL_PTCPE6_WIDTH                   1
#define PORT_PUEL_PTCPE6(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTCPE6_SHIFT))&PORT_PUEL_PTCPE6_MASK)
#define PORT_PUEL_PTCPE7_MASK                    0x800000u
#define PORT_PUEL_PTCPE7_SHIFT                   23
#define PORT_PUEL_PTCPE7_WIDTH                   1
#define PORT_PUEL_PTCPE7(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTCPE7_SHIFT))&PORT_PUEL_PTCPE7_MASK)
#define PORT_PUEL_PTDPE0_MASK                    0x1000000u
#define PORT_PUEL_PTDPE0_SHIFT                   24
#define PORT_PUEL_PTDPE0_WIDTH                   1
#define PORT_PUEL_PTDPE0(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTDPE0_SHIFT))&PORT_PUEL_PTDPE0_MASK)
#define PORT_PUEL_PTDPE1_MASK                    0x2000000u
#define PORT_PUEL_PTDPE1_SHIFT                   25
#define PORT_PUEL_PTDPE1_WIDTH                   1
#define PORT_PUEL_PTDPE1(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTDPE1_SHIFT))&PORT_PUEL_PTDPE1_MASK)
#define PORT_PUEL_PTDPE2_MASK                    0x4000000u
#define PORT_PUEL_PTDPE2_SHIFT                   26
#define PORT_PUEL_PTDPE2_WIDTH                   1
#define PORT_PUEL_PTDPE2(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTDPE2_SHIFT))&PORT_PUEL_PTDPE2_MASK)
#define PORT_PUEL_PTDPE3_MASK                    0x8000000u
#define PORT_PUEL_PTDPE3_SHIFT                   27
#define PORT_PUEL_PTDPE3_WIDTH                   1
#define PORT_PUEL_PTDPE3(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTDPE3_SHIFT))&PORT_PUEL_PTDPE3_MASK)
#define PORT_PUEL_PTDPE4_MASK                    0x10000000u
#define PORT_PUEL_PTDPE4_SHIFT                   28
#define PORT_PUEL_PTDPE4_WIDTH                   1
#define PORT_PUEL_PTDPE4(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTDPE4_SHIFT))&PORT_PUEL_PTDPE4_MASK)
#define PORT_PUEL_PTDPE5_MASK                    0x20000000u
#define PORT_PUEL_PTDPE5_SHIFT                   29
#define PORT_PUEL_PTDPE5_WIDTH                   1
#define PORT_PUEL_PTDPE5(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTDPE5_SHIFT))&PORT_PUEL_PTDPE5_MASK)
#define PORT_PUEL_PTDPE6_MASK                    0x40000000u
#define PORT_PUEL_PTDPE6_SHIFT                   30
#define PORT_PUEL_PTDPE6_WIDTH                   1
#define PORT_PUEL_PTDPE6(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTDPE6_SHIFT))&PORT_PUEL_PTDPE6_MASK)
#define PORT_PUEL_PTDPE7_MASK                    0x80000000u
#define PORT_PUEL_PTDPE7_SHIFT                   31
#define PORT_PUEL_PTDPE7_WIDTH                   1
#define PORT_PUEL_PTDPE7(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTDPE7_SHIFT))&PORT_PUEL_PTDPE7_MASK)
/* PUEH Bit Fields */
#define PORT_PUEH_PTEPE0_MASK                    0x1u
#define PORT_PUEH_PTEPE0_SHIFT                   0
#define PORT_PUEH_PTEPE0_WIDTH                   1
#define PORT_PUEH_PTEPE0(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTEPE0_SHIFT))&PORT_PUEH_PTEPE0_MASK)
#define PORT_PUEH_PTEPE1_MASK                    0x2u
#define PORT_PUEH_PTEPE1_SHIFT                   1
#define PORT_PUEH_PTEPE1_WIDTH                   1
#define PORT_PUEH_PTEPE1(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTEPE1_SHIFT))&PORT_PUEH_PTEPE1_MASK)
#define PORT_PUEH_PTEPE2_MASK                    0x4u
#define PORT_PUEH_PTEPE2_SHIFT                   2
#define PORT_PUEH_PTEPE2_WIDTH                   1
#define PORT_PUEH_PTEPE2(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTEPE2_SHIFT))&PORT_PUEH_PTEPE2_MASK)
#define PORT_PUEH_PTEPE3_MASK                    0x8u
#define PORT_PUEH_PTEPE3_SHIFT                   3
#define PORT_PUEH_PTEPE3_WIDTH                   1
#define PORT_PUEH_PTEPE3(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTEPE3_SHIFT))&PORT_PUEH_PTEPE3_MASK)
#define PORT_PUEH_PTEPE4_MASK                    0x10u
#define PORT_PUEH_PTEPE4_SHIFT                   4
#define PORT_PUEH_PTEPE4_WIDTH                   1
#define PORT_PUEH_PTEPE4(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTEPE4_SHIFT))&PORT_PUEH_PTEPE4_MASK)
#define PORT_PUEH_PTEPE5_MASK                    0x20u
#define PORT_PUEH_PTEPE5_SHIFT                   5
#define PORT_PUEH_PTEPE5_WIDTH                   1
#define PORT_PUEH_PTEPE5(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTEPE5_SHIFT))&PORT_PUEH_PTEPE5_MASK)
#define PORT_PUEH_PTEPE6_MASK                    0x40u
#define PORT_PUEH_PTEPE6_SHIFT                   6
#define PORT_PUEH_PTEPE6_WIDTH                   1
#define PORT_PUEH_PTEPE6(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTEPE6_SHIFT))&PORT_PUEH_PTEPE6_MASK)
#define PORT_PUEH_PTEPE7_MASK                    0x80u
#define PORT_PUEH_PTEPE7_SHIFT                   7
#define PORT_PUEH_PTEPE7_WIDTH                   1
#define PORT_PUEH_PTEPE7(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTEPE7_SHIFT))&PORT_PUEH_PTEPE7_MASK)
#define PORT_PUEH_PTFPE0_MASK                    0x100u
#define PORT_PUEH_PTFPE0_SHIFT                   8
#define PORT_PUEH_PTFPE0_WIDTH                   1
#define PORT_PUEH_PTFPE0(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTFPE0_SHIFT))&PORT_PUEH_PTFPE0_MASK)
#define PORT_PUEH_PTFPE1_MASK                    0x200u
#define PORT_PUEH_PTFPE1_SHIFT                   9
#define PORT_PUEH_PTFPE1_WIDTH                   1
#define PORT_PUEH_PTFPE1(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTFPE1_SHIFT))&PORT_PUEH_PTFPE1_MASK)
#define PORT_PUEH_PTFPE2_MASK                    0x400u
#define PORT_PUEH_PTFPE2_SHIFT                   10
#define PORT_PUEH_PTFPE2_WIDTH                   1
#define PORT_PUEH_PTFPE2(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTFPE2_SHIFT))&PORT_PUEH_PTFPE2_MASK)
#define PORT_PUEH_PTFPE3_MASK                    0x800u
#define PORT_PUEH_PTFPE3_SHIFT                   11
#define PORT_PUEH_PTFPE3_WIDTH                   1
#define PORT_PUEH_PTFPE3(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTFPE3_SHIFT))&PORT_PUEH_PTFPE3_MASK)
#define PORT_PUEH_PTFPE4_MASK                    0x1000u
#define PORT_PUEH_PTFPE4_SHIFT                   12
#define PORT_PUEH_PTFPE4_WIDTH                   1
#define PORT_PUEH_PTFPE4(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTFPE4_SHIFT))&PORT_PUEH_PTFPE4_MASK)
#define PORT_PUEH_PTFPE5_MASK                    0x2000u
#define PORT_PUEH_PTFPE5_SHIFT                   13
#define PORT_PUEH_PTFPE5_WIDTH                   1
#define PORT_PUEH_PTFPE5(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTFPE5_SHIFT))&PORT_PUEH_PTFPE5_MASK)
#define PORT_PUEH_PTFPE6_MASK                    0x4000u
#define PORT_PUEH_PTFPE6_SHIFT                   14
#define PORT_PUEH_PTFPE6_WIDTH                   1
#define PORT_PUEH_PTFPE6(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTFPE6_SHIFT))&PORT_PUEH_PTFPE6_MASK)
#define PORT_PUEH_PTFPE7_MASK                    0x8000u
#define PORT_PUEH_PTFPE7_SHIFT                   15
#define PORT_PUEH_PTFPE7_WIDTH                   1
#define PORT_PUEH_PTFPE7(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTFPE7_SHIFT))&PORT_PUEH_PTFPE7_MASK)
#define PORT_PUEH_PTGPE0_MASK                    0x10000u
#define PORT_PUEH_PTGPE0_SHIFT                   16
#define PORT_PUEH_PTGPE0_WIDTH                   1
#define PORT_PUEH_PTGPE0(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTGPE0_SHIFT))&PORT_PUEH_PTGPE0_MASK)
#define PORT_PUEH_PTGPE1_MASK                    0x20000u
#define PORT_PUEH_PTGPE1_SHIFT                   17
#define PORT_PUEH_PTGPE1_WIDTH                   1
#define PORT_PUEH_PTGPE1(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTGPE1_SHIFT))&PORT_PUEH_PTGPE1_MASK)
#define PORT_PUEH_PTGPE2_MASK                    0x40000u
#define PORT_PUEH_PTGPE2_SHIFT                   18
#define PORT_PUEH_PTGPE2_WIDTH                   1
#define PORT_PUEH_PTGPE2(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTGPE2_SHIFT))&PORT_PUEH_PTGPE2_MASK)
#define PORT_PUEH_PTGPE3_MASK                    0x80000u
#define PORT_PUEH_PTGPE3_SHIFT                   19
#define PORT_PUEH_PTGPE3_WIDTH                   1
#define PORT_PUEH_PTGPE3(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTGPE3_SHIFT))&PORT_PUEH_PTGPE3_MASK)
#define PORT_PUEH_PTHPE0_MASK                    0x1000000u
#define PORT_PUEH_PTHPE0_SHIFT                   24
#define PORT_PUEH_PTHPE0_WIDTH                   1
#define PORT_PUEH_PTHPE0(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTHPE0_SHIFT))&PORT_PUEH_PTHPE0_MASK)
#define PORT_PUEH_PTHPE1_MASK                    0x2000000u
#define PORT_PUEH_PTHPE1_SHIFT                   25
#define PORT_PUEH_PTHPE1_WIDTH                   1
#define PORT_PUEH_PTHPE1(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTHPE1_SHIFT))&PORT_PUEH_PTHPE1_MASK)
#define PORT_PUEH_PTHPE2_MASK                    0x4000000u
#define PORT_PUEH_PTHPE2_SHIFT                   26
#define PORT_PUEH_PTHPE2_WIDTH                   1
#define PORT_PUEH_PTHPE2(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTHPE2_SHIFT))&PORT_PUEH_PTHPE2_MASK)
#define PORT_PUEH_PTHPE6_MASK                    0x40000000u
#define PORT_PUEH_PTHPE6_SHIFT                   30
#define PORT_PUEH_PTHPE6_WIDTH                   1
#define PORT_PUEH_PTHPE6(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTHPE6_SHIFT))&PORT_PUEH_PTHPE6_MASK)
#define PORT_PUEH_PTHPE7_MASK                    0x80000000u
#define PORT_PUEH_PTHPE7_SHIFT                   31
#define PORT_PUEH_PTHPE7_WIDTH                   1
#define PORT_PUEH_PTHPE7(x)                      (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTHPE7_SHIFT))&PORT_PUEH_PTHPE7_MASK)
/* HDRVE Bit Fields */
#define PORT_HDRVE_PTB4_MASK                     0x1u
#define PORT_HDRVE_PTB4_SHIFT                    0
#define PORT_HDRVE_PTB4_WIDTH                    1
#define PORT_HDRVE_PTB4(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_HDRVE_PTB4_SHIFT))&PORT_HDRVE_PTB4_MASK)
#define PORT_HDRVE_PTB5_MASK                     0x2u
#define PORT_HDRVE_PTB5_SHIFT                    1
#define PORT_HDRVE_PTB5_WIDTH                    1
#define PORT_HDRVE_PTB5(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_HDRVE_PTB5_SHIFT))&PORT_HDRVE_PTB5_MASK)
#define PORT_HDRVE_PTD0_MASK                     0x4u
#define PORT_HDRVE_PTD0_SHIFT                    2
#define PORT_HDRVE_PTD0_WIDTH                    1
#define PORT_HDRVE_PTD0(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_HDRVE_PTD0_SHIFT))&PORT_HDRVE_PTD0_MASK)
#define PORT_HDRVE_PTD1_MASK                     0x8u
#define PORT_HDRVE_PTD1_SHIFT                    3
#define PORT_HDRVE_PTD1_WIDTH                    1
#define PORT_HDRVE_PTD1(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_HDRVE_PTD1_SHIFT))&PORT_HDRVE_PTD1_MASK)
#define PORT_HDRVE_PTE0_MASK                     0x10u
#define PORT_HDRVE_PTE0_SHIFT                    4
#define PORT_HDRVE_PTE0_WIDTH                    1
#define PORT_HDRVE_PTE0(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_HDRVE_PTE0_SHIFT))&PORT_HDRVE_PTE0_MASK)
#define PORT_HDRVE_PTE1_MASK                     0x20u
#define PORT_HDRVE_PTE1_SHIFT                    5
#define PORT_HDRVE_PTE1_WIDTH                    1
#define PORT_HDRVE_PTE1(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_HDRVE_PTE1_SHIFT))&PORT_HDRVE_PTE1_MASK)
#define PORT_HDRVE_PTH0_MASK                     0x40u
#define PORT_HDRVE_PTH0_SHIFT                    6
#define PORT_HDRVE_PTH0_WIDTH                    1
#define PORT_HDRVE_PTH0(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_HDRVE_PTH0_SHIFT))&PORT_HDRVE_PTH0_MASK)
#define PORT_HDRVE_PTH1_MASK                     0x80u
#define PORT_HDRVE_PTH1_SHIFT                    7
#define PORT_HDRVE_PTH1_WIDTH                    1
#define PORT_HDRVE_PTH1(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_HDRVE_PTH1_SHIFT))&PORT_HDRVE_PTH1_MASK)

/*!
 * @}
 */ /* end of group PORT_Register_Masks */


