ErichStyger/mcuoneclipse/Examples/KDS/FRDM-KE02Z/FRDM-KE02Z/Static_Code/IO_Map/MKE02Z2.h
/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_defines */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */

#define FPTA_BASE_PTR                     FGPIOA_BASE_PTR
#define FPTB_BASE_PTR                     FGPIOB_BASE_PTR
#define PTA_BASE_PTR                      GPIOA_BASE_PTR
#define PTB_BASE_PTR                      GPIOB_BASE_PTR
#define FTM0_CNTIN                        This_symbol_has_been_deprecated
#define FTM0_STATUS                       This_symbol_has_been_deprecated
#define FTM0_MODE                         This_symbol_has_been_deprecated
#define FTM0_SYNC                         This_symbol_has_been_deprecated
#define FTM0_OUTINIT                      This_symbol_has_been_deprecated
#define FTM0_OUTMASK                      This_symbol_has_been_deprecated
#define FTM0_COMBINE                      This_symbol_has_been_deprecated
#define FTM0_DEADTIME                     This_symbol_has_been_deprecated
#define FTM0_EXTTRIG                      This_symbol_has_been_deprecated
#define FTM0_POL                          This_symbol_has_been_deprecated
#define FTM0_FMS                          This_symbol_has_been_deprecated
#define FTM0_FILTER                       This_symbol_has_been_deprecated
#define FTM0_FLTCTRL                      This_symbol_has_been_deprecated
#define FTM0_CONF                         This_symbol_has_been_deprecated
#define FTM0_FLTPOL                       This_symbol_has_been_deprecated
#define FTM0_SYNCONF                      This_symbol_has_been_deprecated
#define FTM0_INVCTRL                      This_symbol_has_been_deprecated
#define FTM0_SWOCTRL                      This_symbol_has_been_deprecated
#define FTM0_PWMLOAD                      This_symbol_has_been_deprecated
#define FTM1_CNTIN                        This_symbol_has_been_deprecated
#define FTM1_STATUS                       This_symbol_has_been_deprecated
#define FTM1_MODE                         This_symbol_has_been_deprecated
#define FTM1_SYNC                         This_symbol_has_been_deprecated
#define FTM1_OUTINIT                      This_symbol_has_been_deprecated
#define FTM1_OUTMASK                      This_symbol_has_been_deprecated
#define FTM1_COMBINE                      This_symbol_has_been_deprecated
#define FTM1_DEADTIME                     This_symbol_has_been_deprecated
#define FTM1_EXTTRIG                      This_symbol_has_been_deprecated
#define FTM1_POL                          This_symbol_has_been_deprecated
#define FTM1_FMS                          This_symbol_has_been_deprecated
#define FTM1_FILTER                       This_symbol_has_been_deprecated
#define FTM1_FLTCTRL                      This_symbol_has_been_deprecated
#define FTM1_CONF                         This_symbol_has_been_deprecated
#define FTM1_FLTPOL                       This_symbol_has_been_deprecated
#define FTM1_SYNCONF                      This_symbol_has_been_deprecated
#define FTM1_INVCTRL                      This_symbol_has_been_deprecated
#define FTM1_SWOCTRL                      This_symbol_has_been_deprecated
#define FTM1_PWMLOAD                      This_symbol_has_been_deprecated
#define NV_DFPROT_REG(base)               NV_EEPROT_REG(base)
#define NV_DFPROT_DPS_MASK                NV_EEPROT_DPS_MASK
#define NV_DFPROT_DPS_SHIFT               NV_EEPROT_DPS_SHIFT
#define NV_DFPROT_DPS(x)                  NV_EEPROT_DPS(x)
#define NV_DFPROT_DPOPEN_MASK             NV_EEPROT_DPOPEN_MASK
#define NV_DFPROT_DPOPEN_SHIFT            NV_EEPROT_DPOPEN_SHIFT
#define NV_DFPROT_DPOPEN_SHIFT            NV_EEPROT_DPOPEN_SHIFT
#define PMC_SPMSC1_BGBDS_MASK             This_symbol_has_been_deprecated
#define PMC_SPMSC1_BGBDS_SHIFT            This_symbol_has_been_deprecated
#define SIM_PINSEL_IICPS_MASK             SIM_PINSEL_I2C0PS_MASK
#define SIM_PINSEL_IICPS_SHIFT            SIM_PINSEL_I2C0PS_SHIFT
#define SIM_SCGC_IIC_MASK                 SIM_SCGC_I2C_MASK
#define SIM_SCGC_IIC_SHIFT                SIM_SCGC_I2C_SHIFT
#define NVIC_ISER_SETENA_MASK             0xFFFFFFFFu
#define NVIC_ISER_SETENA_SHIFT            0
#define NVIC_ISER_SETENA(x)               (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA_SHIFT))&NVIC_ISER_SETENA_MASK)
#define NVIC_ICER_CLRENA_MASK             0xFFFFFFFFu
#define NVIC_ICER_CLRENA_SHIFT            0
#define NVIC_ICER_CLRENA(x)               (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA_SHIFT))&NVIC_ICER_CLRENA_MASK)
#define NVIC_ISPR_SETPEND_MASK            0xFFFFFFFFu
#define NVIC_ISPR_SETPEND_SHIFT           0
#define NVIC_ISPR_SETPEND(x)              (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND_SHIFT))&NVIC_ISPR_SETPEND_MASK)
#define NVIC_ICPR_CLRPEND_MASK            0xFFFFFFFFu
#define NVIC_ICPR_CLRPEND_SHIFT           0
#define NVIC_ICPR_CLRPEND(x)              (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND_SHIFT))&NVIC_ICPR_CLRPEND_MASK)
#define SCB_ICSR_VECTACTIVE_MASK          This_symbol_has_been_deprecated
#define SCB_ICSR_VECTACTIVE_SHIFT         This_symbol_has_been_deprecated
#define SCB_ICSR_VECTACTIVE(x)            This_symbol_has_been_deprecated
#define SCB_ICSR_ISRPENDING_MASK          This_symbol_has_been_deprecated
#define SCB_ICSR_ISRPENDING_SHIFT         This_symbol_has_been_deprecated
#define INT_Watchdog                      INT_WDOG_EWM

/*!
 * @}
 */ /* end of group Backward_Compatibility_Symbols */


#else /* #if !defined(MCU_MKE02Z2) && !defined(MCU_MKE02Z4) && !defined(MCU_SKEAZN642) */
  /* There is already included the same memory map. Check if it is compatible (has the same major version) */
  #if (MCU_MEM_MAP_VERSION != 0x0100u)
    #if (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING))
      #warning There are included two not compatible versions of memory maps. Please check possible differences.
    #endif /* (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING)) */
  #endif /* (MCU_MEM_MAP_VERSION != 0x0100u) */
#endif  /* #if !defined(MCU_MKE02Z2) && !defined(MCU_MKE02Z4) && !defined(MCU_SKEAZN642) */

/* MKE02Z2.h, eof. */
